% 状態ベクトルから，状態スカラーへ変換するためのプログラム

function [state]=encode(state)
  % 8通りの変換
  convert = [1,2,3,4,5,6,7,8,9;  %元の状態
             3,2,1,6,5,4,9,8,7;  %変換(2)
             7,4,1,8,5,2,9,6,3;  %変換(3)
             1,4,7,2,5,8,3,6,9;  %変換(4)
             9,8,7,6,5,4,3,2,1;  %変換(5)
             7,8,9,4,5,6,1,2,3;  %変換(6)
             3,6,9,2,5,8,1,4,7;  %変換(7)
             9,6,3,8,5,2,7,4,1   %変換(8)
           ];

  % 3進数から10進数へと変換するためのベクトル
  power = [3^8 3^7 3^6 3^5 3^4 3^3 3^2 3^1 3^0];

  % stateを8種類の変換を加えてから10進数へと変換する
  for i=1:size(convert,1)
    cands(i) = sum(state(convert(i,:))*power');
  end

  % 8個の候補のうち一番小さいものを選ぶ
  state = min(cands)+1;